app/controllers/materias_controller.rb

SELECT * FROM "materias"
---
  def list
      @materias = Materia.all

SELECT * FROM "materias" WHERE ("materias"."id" = 1)
---
  def show
      @materia = Materia.find(params[:id])